#pragma once
#include <stdio.h>

void task1_bubble();


/**
 * \brief Вывод меню в консоль
 */
inline void PrintMenu()
{
	printf("\n***********************************************************************************\n");
	printf("Введите цифру дальнейшего действия (int):\n");
	printf("[1] - Задача 1. Попробовать оптимизировать пузырьковую сортировку.\n");
	printf("[0] - Выход\n");
	printf("Ваш выбор:> ");
}

/**
 * \brief Вызов выбранной пользователем задачи
 * \param select Выбранная задача
 */
inline void actionSelect(int select)
{
	switch (select)
	{
	case 1: task1_bubble();
		break;
	case 0: break;
	default:
		printf("Неверный выбор.\a\n");
	}
}

/**
 * \brief Заголовок консольного приложения
 */
inline void PrintHeader()
{
	printf("**************************************************************************************\n");
	printf("*                    Алгоритмы и структуры данных. Базовый курс.                     *\n");
	printf("*              Урок 2. Асимптотическая сложность алгоритма. Рекурсия                 *\n");
	printf("**************************************************************************************\n\n");
}

/**
 * \brief Подвал консольного приложения
 */
inline void PrintFooter()
{
	printf("Для выхода из программы нажмите кнопку ...");
	getchar();
}

