#pragma once
#include <windows.h>
#include <stdio.h>

void Task1Matrix();

/**
 * \brief Русификация
 */
inline void Ru()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
}

/**
 * \brief Вывод меню в консоль
 */
inline void PrintMenu()
{
	puts("\n**************************************************************************************");
	puts("Введите цифру дальнейшего действия (int):");
	puts("[1] - Задача 1. Написать функции, которые считывают матрицу смежности из файла и выводят ее на экран.");
	puts("[0] - Выход");
	printf("Ваш выбор:> ");
}

/**
 * \brief Вызов выбранной пользователем задачи
 * \param select Выбранная задача
 */
inline void ActionSelect(int select)
{
	switch (select)
	{
	case 1: Task1Matrix();
		break;
	case 0: break;
	default:
		puts("Неверный выбор.\a");
	}
}

/**
 * \brief Заголовок консольного приложения
 */
inline void PrintHeader()
{
	puts("**************************************************************************************");
	puts("*                    Алгоритмы и структуры данных. Базовый курс.                     *");
	puts("*                        Урок 7. Графы. Алгоритмы на графах.                         *");
	puts("**************************************************************************************\n");
}

/**
 * \brief Завершение консольного приложения
 */
inline void PrintFooter()
{
	puts("Для выхода из программы нажмите любую кнопку ...");
	getchar();
}
