#pragma once
#include <windows.h>
#include <stdio.h>

#include "Task1Hash.h"
#include "Task2Tree.h"

void Task1Hash();
void Task2Tree();

/**
 * \brief Русификация
 */
inline void Ru()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
}

/**
 * \brief Вывод меню в консоль
 */
inline void PrintMenu()
{
	puts("\n**************************************************************************************");
	puts("Введите цифру дальнейшего действия (int):");
	puts("[1] - Задача 1. Реализовать простейшую хеш-функцию. На вход функции подается строка, на выходе сумма кодов символов.");
	puts("[2] - Задача 2. Переписать программу, реализующую двоичное дерево поиска.");
	puts("[0] - Выход");
	printf("Ваш выбор:> ");
}

/**
 * \brief Вызов выбранной пользователем задачи
 * \param select Выбранная задача
 */
inline void actionSelect(int select)
{
	switch (select)
	{
	case 1: Task1Hash();
		break;
	case 2: Task2Tree();
		break;
	case 0: break;
	default:
		puts("Неверный выбор.\a");
	}
}

/**
 * \brief Заголовок консольного приложения
 */
inline void PrintHeader()
{
	puts("**************************************************************************************");
	puts("*                    Алгоритмы и структуры данных. Базовый курс.                     *");
	puts("*                                    Урок 6. Деревья                                 *");
	puts("**************************************************************************************\n");
}

/**
 * \brief Завершение консольного приложения
 */
inline void PrintFooter()
{
	puts("Для выхода из программы нажмите любую кнопку ...");
	getchar();
}
