#pragma once
#include <stdio.h>

void task1_convert();
void task2_pow();
void task3_calculator();

/**
 * \brief Вывод меню в консоль
 */
inline void PrintMenu()
{
	printf("\n***********************************************************************************\n");
	printf("Введите цифру дальнейшего действия (int):\n");
	printf("[1] - Задача 1. Реализовать функцию перевода из десятичной системы в двоичную, используя рекурсию.\n");
	printf("[2] - Задача 2. Реализовать функцию возведения числа a в степень b.\n");
	printf("[3] - Задача 3.* Исполнитель Калькулятор преобразует целое число, записанное на экране.\n");
	printf("[0] - Выход\n");
	printf("Ваш выбор:> ");
}

/**
 * \brief Вызов выбранной пользователем задачи
 * \param select Выбранная задача
 */
inline void actionSelect(int select)
{
	switch (select)
	{
	case 1: task1_convert();
		break;
	case 2: task2_pow();
		break;
	case 3: task3_calculator();
		break;
	case 0: break;
	default:
		printf("Неверный выбор.\a\n");
	}
}

/**
 * \brief Заголовок консольного приложения
 */
inline void PrintHeader()
{
	printf("**************************************************************************************\n");
	printf("*                    Алгоритмы и структуры данных. Базовый курс.                     *\n");
	printf("*              Урок 2. Асимптотическая сложность алгоритма. Рекурсия                 *\n");
	printf("**************************************************************************************\n\n");
}

/**
 * \brief Подвал консольного приложения
 */
inline void PrintFooter()
{
	printf("Для выхода из программы нажмите кнопку ...");
	getchar();
}
