#pragma once
#include <stdio.h>

inline void PrintHeader()
{
	printf("**************************************************************************************\n");
	printf("*                    Алгоритмы и структуры данных. Базовый курс.                     *\n");
	printf("*              Урок 2. Асимптотическая сложность алгоритма. Рекурсия                 *\n");
	printf("**************************************************************************************\n\n");
}

inline void PrintFooter()
{
	printf("Для выхода из программы нажмите кнопку ...");
	getchar();
}
