#pragma once
#include <windows.h>
#include <stdio.h>

void task1_counter();
void task2_lcs();
void task3_horse();

/**
 * \brief Русификация
 */
inline void Ru()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
}

/**
 * \brief Вывод меню в консоль
 */
inline void PrintMenu()
{
	printf("\n**************************************************************************************\n");
	printf("Введите цифру дальнейшего действия (int):\n");
	printf("[1] - Задача 1. Количество маршрутов с препятствиями. Реализовать чтение массива с препятствием и нахождение количество маршрутов.\n");
	printf("[2] - Задача 2. Решить задачу о нахождении длины максимальной последовательности с помощью матрицы.\n");
	printf("[3] - Задача 3. Обход конем шахматной доски.\n");
	printf("[0] - Выход\n");
	printf("Ваш выбор:> ");
}

/**
 * \brief Вызов выбранной пользователем задачи
 * \param select Выбранная задача
 */
inline void actionSelect(int select)
{
	switch (select)
	{
	case 1: task1_counter();
		break;
	case 2: task2_lcs();
		break;
	case 3: task3_horse();
		break;
	case 0: break;
	default:
		printf("Неверный выбор.\a\n");
	}
}

/**
 * \brief Заголовок консольного приложения
 */
inline void PrintHeader()
{
	printf("**************************************************************************************\n");
	printf("*                    Алгоритмы и структуры данных. Базовый курс.                     *\n");
	printf("*              Урок 4. Динамическое программирование. Поиск возвратом                *\n");
	printf("**************************************************************************************\n\n");
}

/**
 * \brief Завершение консольного приложения
 */
inline void PrintFooter()
{
	printf("Для выхода из программы нажмите кнопку ...");
	getchar();
}